board = {'(1,1)': ' ', '(1,2)': ' ', '(1,3)': ' ', '(2,1)': ' ', '(2,2)': ' ', '(2,3)': ' ', '(3,1)': ' ', '(3,2)': ' ',
         '(3,3)': ' '}


# Функция печати таблици
def board_print(a):
    print(' ', 1, 2, 3)
    print('1 ' + a['(1,1)'] + '|' + a['(1,2)'] + '|' + a['(1,3)'])
    print('---------')
    print('2 ' + a['(2,1)'] + '|' + a['(2,2)'] + '|' + a['(2,3)'])
    print('---------')
    print('3 ' + a['(3,1)'] + '|' + a['(3,2)'] + '|' + a['(3,3)'])


board_print(board)


# Пояснение как вводить
print('''Варианты ввода координат: 
(1,1)|(1,2)|(1,3)
----------------- 
(2,1)|(2,2)|(2,3) 
-----------------
(3,1)|(3,2)|(3,3)''')
print()

# Функция ввода
def input_xy(b, z):
    
    if b not in board:
        print('Координаты не коректны')
        
    if z != 'x' and z != '0':
        print('Вводить можно только х и 0')
        input_xy(input('Координаты '), input('Символ '))

    if board[b] == " ":
        board[b] = z
    else:
        print('Клетка занята')


# Цикл ведущий к победе
game = True
while game:
    input_xy(input('Координаты '), input('Символ '))

    board_print(board)

    # Горизонтальные условия победы
    if board['(1,1)'] == board['(1,2)'] == board['(1,3)'] != ' ':
        game = False
        print('Победа ' + board['(1,1)'] + ' Ура!!!')
    elif board['(2,1)'] == board['(2,2)'] == board['(2,3)'] != ' ':
        print('Победа ' + board['(2,1)'] + ' Ура!!!')
        game = False
    elif board['(3,1)'] == board['(3,2)'] == board['(3,3)'] != ' ':
        print('Победа ' + board['(3,1)'] + ' Ура!!!')
        game = False

    # Вертикальные условия победы
    elif board['(1,1)'] == board['(2,1)'] == board['(3,1)'] != ' ':
        print('Победа ' + board['(1,1)'] + ' Ура!!!')
        game = False
    elif board['(1,2)'] == board['(2,2)'] == board['(3,2)'] != ' ':
        print('Победа ' + board['(1,2)'] + ' Ура!!!')
        game = False
    elif board['(1,3)'] == board['(2,3)'] == board['(3,3)'] != ' ':
        print('Победа ' + board['(1,3)'] + ' Ура!!!')
        game = False

    # Диоганальные условия победы
    elif board['(1,1)'] == board['(2,2)'] == board['(3,3)'] != ' ':
        print('Победа ' + board['(1,1)'] + ' Ура!!!')
        game = False
    elif board['(1,3)'] == board['(2,2)'] == board['(3,1)'] != ' ':
        print('Победа ' + board['(1,3)'] + ' Ура!!!')
        game = False

print('Спасибо за игру')